#include"command.h"

int main()
{
int vr, m=0;
system("clear\n");
printf("_______________________________________________________\n");
printf("|  ▄███▀▀▀▀▀███▄                                      | \n");
printf("|  █▀▀▀▀▀▀▀▀▀▀▀█                                      | \n");
printf("|  █░░█▀▀▀▀▀█░░█                  (Оптимальный)       | \n");
printf("|  █░░█░░░░░█░░█                     \\(0^0)/          | \n");
printf("|  █░░█░░░░░█░░█                 (Тарифный план)      | \n");
printf("|  █░░█░░░░░█░░█                                      | \n");
printf("|  █░░▀▀▀▀▀▀▀░░█                                      | \n");
printf("|  █▀▀▀▀▀▀▀▀▀▀▀█                     (1.START)        | \n");
printf("|  █░░▀░░▀░░▀░░█                                      | \n");
printf("|  █░░▀░░▀░░▀░░█                      (2.xXx)         | \n");
printf("|  █░░▀░░▀░░▀░░█                     (3.OLIST)        | \n");
printf("|  █▄▄▄▄▄▄▄▄▄▄▄█                   (4.DEVELOPERS)     | \n");
printf("|  ▀███████████▀                      (5.EXIT)        | \n");
printf("|_____________________________________________________| \n");
printf("| Пожалуста, выберите нужный пункт меню:              | \n");
printf("|_____________________________________________________| \n");
scanf("%d", &vr);

if(vr == 1){

system("clear\n");
//============================================================================
int v, s, l;
system("clear\n");
printf("______________________________________________________________\n");
printf("|Добрый день, вас приветствует ваша курсовая раборта         |\n");
printf("|____________________________________________________________|\n");
printf("|Ответьте на парочку вопросов:                               |\n");
printf("|1. Вы разрешаете приложению начать свою работу?             |\n");
printf("|  -ДА  (1)                                                  |\n");
printf("|  -НЕТ (2)                                                  |\n");
printf("|____________________________________________________________|\n");
     scanf("%d", &v);
 if (v==2){
 printf("|__________________________________________________________|\n");
 printf("|Ну и что тогда ты тут делаешь?                            |\n");
 printf("|__________________________________________________________|\n");
  return 0;
  }
if (v==1){
system("clear\n");
  printf("____________________________________________________________\n");
  printf("|-Доступные оператоы на данный момент-                      |\n");
  printf("|___________________________________________________________|\n");
  printf("|-Мегафон          (1)                                      |\n");
  printf("|-МTC              (2)                                      |\n");
  printf("|-TELE2            (3)                                      |\n");
  printf("|-Билайн           (4)                                      |\n");
  printf("|___________________________________________________________|\n");
     scanf("%d", &s);
}
     system("clear\n");
   printf("____________________________________________________________\n");
   printf("|ПОЖАЛУЙСТА, выберите приоритетный Параметр                |\n");
   printf("|__________________________________________________________|\n");
   printf("|Минуты для звонков              (1)                       |\n");
   printf("|Интернет-трафик                 (2)                       |\n");
   printf("|Служба-коротких-сообщений(смс)  (3)                       |\n");
   printf("|NotStated                       (4)                       |\n");
   printf("|Эконом                          (5)                       |\n");
   printf("|__________________________________________________________|\n");
    scanf("%d", &l);
if(s==1){m=m+10;} if(s==2){m=m+20;} if(s==3){m=m+30;} if(s==4){m=m+40;}
if(l==1){m=m+1;} if(l==2){m=m+2;} if(l==3){m=m+3;} if(l==4){m=m+4;} if(l==5){m=m+5;} 
printf("%d\n", m);
 meg(m);
 mts(m);
 tel(m);
 bil(m);

//===========================================================================
 if (v==2){
 printf("|__________________________________________________________|\n");
 printf("|Ну и что тогда ты тут делаешь?                            |\n");
 printf("|__________________________________________________________|\n");
  return 0;
  }
}
 

if(vr == 2){
printf("|_____________________________________________________| \n");
printf("|        здесь могла быть ваша реклама                | \n");
printf("|_____________________________________________________| \n");
}

if(vr==3){
system("clear\n");
system("./tablo");
}

if(vr==4){
printf("==============(В разработке учавствовали)=============\n");
printf("        Студенты первого курса группы ИВ-223          \n");
printf("======================================================\n");
printf("Румянцев Александр Иванович\n");

printf("-Прописал Интерфейс\n");
printf("-Создал Makefile\n");
printf("-Делали общими усилиями основной алгоритм\n");
printf("-Создал общую таблицу тарифов для параметра OLIST\n");
printf("-Загрузил на Гит\n");
printf("------------------------------------------------------\n");
printf("Межаков Павел Сергеевич\n");

printf("-Учавствовал в создании интерфейса\n");
printf("-Делали общими усилиями основной алгоритм\n");
printf("-Собирал сатистику по тарифам операторов\n");
printf("-Загрузил на Гит\n");
printf("======================================================\n");
return 0;
}

if(vr == 5){
return 0;
}
return 0;
}
