#include <stdlib.h>
#include <stdio.h>

void menu1(){
    printf("______________________________________________________________\n");
    printf("|Добрый день, вас приветствует ваша курсовая раборта         |\n");
    printf("|____________________________________________________________|\n");
    printf("|Ответьте на парочку вопросов:                               |\n");
    printf("|1. Вы разрешаете приложению начать свою работу?             |\n");
    printf("|  -ДА  (1)                                                  |\n");
    printf("|  -НЕТ (2)                                                  |\n");
    printf("|____________________________________________________________|\n");
}

void menu2(){
    printf("____________________________________________________________\n");
    printf("|-Доступные оператоы на данный момент-                      |\n");
    printf("|___________________________________________________________|\n");
    printf("|-Мегафон          (1)                                      |\n");
    printf("|-МTC              (2)                                      |\n");
    printf("|-TELE2            (3)                                      |\n");
    printf("|-Билайн           (4)                                      |\n");
    printf("|___________________________________________________________|\n");
}

void menu3(){
    printf("____________________________________________________________\n");
    printf("|ПОЖАЛУЙСТА, выберите приоритетный Параметр                |\n");
    printf("|__________________________________________________________|\n");
    printf("|Минуты для звонков              (1)                       |\n");
    printf("|Интернет-трафик                 (2)                       |\n");
    printf("|Служба-коротких-сообщений(смс)  (3)                       |\n");
    printf("|NotStated                       (4)                       |\n");
    printf("|Эконом                          (5)                       |\n");
    printf("|__________________________________________________________|\n");
}